# PointCloudOverrides Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudOverrides Methods
PointCloudOverrides Class See Also
---
The PointCloudOverrides type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArePointCloudOverrideSettingsValid | Checks if PointCloudOverrideSettings are valid |
| Assign | Assigns values of the source overrides to this object. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPointCloudRegionOverrideSettings(ElementId) | Gets region override settings assigned to the whole PointCloudInstance element. |
| GetPointCloudRegionOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular region within a PointCloudInstance element. |
| GetPointCloudScanOverrideSettings(ElementId) | Gets scan override settings assigned to the whole PointCloudInstance element. |
| GetPointCloudScanOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular scan within a PointCloudInstance element. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Check if the contents of two overrides are equal. |
| SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns region override settings to the whole PointCloudInstance element. |
| SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns override settings to a particular region within a PointCloudInstance element. |
| SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns scan override settings to the whole PointCloudInstance element. |
| SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns scan override settings to a particular scan within a PointCloudInstance element. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace